package org.training.spark.sql

import org.apache.spark.sql.{SQLContext, SaveMode}
import org.apache.spark.{SparkConf, SparkContext}

/**
  * Created by fuli.shen on 2016/11/1.
  */
object Timex3SparkSQL {


  def main(args: Array[String]) {


    var masterUrl = "local[1]"
    var dataPath = "hdfs://10.4.1.1:9000/user/fuli.shen/data/timex3-2m/"
    if (args.length != 0) {
      masterUrl = args(0)
      dataPath = args(1)
    }
    val conf = new SparkConf().setAppName(Timex3SparkSQL.getClass.getSimpleName).setMaster(masterUrl)
    val sc = new SparkContext(conf)

    val sqlContext = new SQLContext(sc)

    /**
      * Create RDDs
      */
    val timex3DF = sqlContext.read.format("json").load(dataPath + "timex3-2m.json")
    timex3DF.registerTempTable("timex3feature")

    /*
    all timex3 type:
                  +--------+
                  |    type|
                  +--------+
                  |    DATE|
                  |DURATION|
                  |    TIME|
                  |     SET|
                  +--------+
    */
    val timex3feature = sqlContext.sql("select distinct type from timex3feature group by type ")
    timex3feature.show()
    timex3feature.repartition(1).write.mode(SaveMode.Overwrite).json(dataPath + "timex3featureDate")

    /* 1:DATE
        +----------+----------+
        |     value|      name|
        +----------+----------+
        |        00|       ００年|
        |        00|       本世纪|
        |       002|    二十世纪中期|
        |       002|    ２０世纪初期|
        |       002|     ２０世纪末|
        |   0024-11|     去年１１月|
        |      0025|  ２０世纪５０年代|
        |      0025|       两年前|
        |      0026|  ２０世纪６０年代|
        |      0027|  ２０世纪７０年代|
        |      0028|  ２０世纪８０年代|
        |      0029|  ２０世纪９０年代|
        |       003|      ３０年代|
        |       004|      四十年代|
        |       005|      ５０年代|
        |       006|      ６０年代|
        |       006|      六十年代|
        |       007|     ７０年代末|
        |       007|      ７０年代|
        |       008|      八十年代|
        |       008|     ８０年代初|
        |       008|      ８０年代|
        |       009|    ９０年代初期|
        |       009|     ９０年代初|
        |       009|       新时期|
        |       009|    ９０年代后期|
        |       009|      ９０年代|
        |       009|    ９０年代中期|
        |        01|       ０１年|
        |        02|       ０２年|
        |        03|       ０３年|
        |        04|       ０４年|
        |     04-01|     ０４年１月|
        |        05|       ０５年|
        |     05-06|     ０５年６月|
        |  05-07-02|   ０５年７月２日|
        |     05-11|    ０５年１１月|
        |        06|      ０６年底|
        |        06|       ０６年|
        |     06-08|     ０６年８月|
        |     06-09|     ０６年９月|
        |     06-12|    ０６年１２月|
        |  06-12-31| ０６年１２月３１日|
        |        07|      ０７年末|
        |        07|       ０７年|
        |        07|      ０７年底|
        |     07-08|     ０７年８月|
        |  07-09-24|  ０７年９月２４日|
        |  07-11-10| ０７年１１月１０日|
        |     07-12|    ０７年１２月|
        |        08|       ０８年|
        |     08-01|     ０８年一月|
        |     08-01|     ０８年１月|
        |     08-03|     ０８年３月|
        |     08-04|     ０８年４月|
        |     08-05|     ０８年五月|
        |     08-05|     ０８年５月|
        |  08-05-30|  ０８年５月３０日|
        |     08-07|     ０８年７月|
        |     08-12|    ０８年１２月|
        |        09|       ０９年|
        |        09|       上世纪|
        |     09-01|     ０９年１月|
        |     09-04|     ０９年４月|
        |        10|       １０年|
        |       109|    九十年代中期|
        |        11|       １１年|
        |        12|       １２年|
        |        12|       一二年|
        |        13|       １３年|
        |      1300|     １３００年|
        |        14|       １４年|
        |      1410|     １４１０年|
        |        15|       １５年|
        |      1500|     １５００年|
        |        16|       １６年|
        |      1631|     １６３１年|
        |      1652|     １６５２年|
        |      1662|     １６６２年|
        |      1681|     １６８１年|
        |   1683-12|  １６８３年１２月|
        |      1690|     １６９０年|
        |      1694|     １６９４年|
        |        17|       上世纪|
        |        17|       １７年|
        |       173|      ３０年代|
        |      1732|     １７３２年|
        |      1757|     １７５７年|
        |      1764|     １７６４年|
        |1769-09-21|１７６９年９月２１日|
        |   1775-04|   １７７５年４月|
        |      1792|     １７９２年|
        |        18|       上世纪|
        |        18|       本世纪|
        |        18|       １８年|
        |        18|      上世纪末|
        |      1800|     １８００年|
        |      1815|     １８１５年|
        |1815-02-23|     ２月２３日|
        |      1827|  ２０世纪７０年代|
        |      1840|     １８４０年|
        |       185|    ５０年代后期|
        |      1858|     １８５８年|
        |       186|      ６０年代|
        |       186|    六十年代中期|
        |      1860|     １８６０年|
        |      1862|     １８６２年|
        |       187|     ７０年代末|
        |      1878|      ８８年前|
        |       188|     ８０年代初|
        |       188|     ８０年代末|
        |       188|      八十年代|
        |       188|      ８０年代|
        |1886-03-19|１８８６年３月１９日|
        |       189|    ９０年代后期|
        |       189|     ９０年代初|
        |      1890|     １８９０年|
        |      1891|     １８９１年|
        |      1896|     １８９６年|
        |      1899|     １８９９年|
        |        19|       上世纪|
        |        19|      上个世纪|
        |      1900|     １９００年|
        |1902-08-07| １９０２年８月７日|
        |   1903-05|   １９０３年５月|
        |      1905|     １９０５年|
        |      1906|     １９０６年|
        |   1907-04|   １９０７年４月|
        |      1908|     １９０８年|
        |      1909|     １９０９年|
        |      1912|     １９１２年|
        |      1913|     １９１３年|
        |      1914|     １９１４年|
        |1914-03-24|１９１４年３月２４日|
        |1914-07-03| １９１４年７月３日|
        |      1916|     １９１６年|
        |      1917|     １９１７年|
        |      1918|     １９１８年|
        |1918-04-18|１９１８年４月１８日|
        |1919-04-11|１９１９年４月１１日|
        |       192|     ２０世纪初|
        |      1920|     １９２０年|
        |      1922|     １９２２年|
        |   1922-04|   １９２２年４月|
        |      1924|     １９２４年|
        |   1924-05|   １９２４年５月|
        |1925-01-26|１９２５年１月２６日|
        |      1926|     １９２６年|
        |      1927|  ２０世纪７０年代|
        |   1927-10|  １９２７年１０月|
        |      1928|     １９２８年|
        |   1928-SU|        夏天|
        |      1929|     １９２９年|
        |   1929-10|  １９２９年１０月|
        |1929-10-29|    １０月２９日|
        |       193|      ３０年代|
        |       193|      三十年代|
        |      1930|     １９３０年|
        |      1931|      一九三一|
        |      1931|     一九三一年|
        |      1931|     １９３１年|
        |      1932|      一九三二|
        |      1932|     １９３２年|
        |   1932-02|   １９３２年２月|
        |1932-03-09| １９３２年３月９日|
        |   1932-04|   １９３２年４月|
        |      1934|     １９３４年|
        |   1934-10|  １９３４年１０月|
        |      1935|     １９３５年|
        |1935-05-12|１９３５年５月１２日|
        |1935-06-26|     ６月２６日|
        |      1936|     １９３６年|
        |      1937|     一九三七年|
        |      1937|     １９３７年|
        |   1937-H2|  １９３７年下半年|
        |      1938|     １９３８年|
        |   1938-02|   １９３８年２月|
        |1938-05-13|１９３８年５月１３日|
        |1938-09-14|     ９月１４日|
        |      1939|     １９３９年|
        |1939-08-20|１９３９年８月２０日|
        |      1940|     １９４０年|
        |      1941|     １９４１年|
        |   1941-12|  １９４１年１２月|
        |      1942|     １９４２年|
        |      1943|     一九四三年|
        |      1943|        今年|
        |      1943|      ２９年前|
        |      1944|     一九四四年|
        |      1944|     １９４４年|
        |1944-02-14|     二月十四日|
        |   1944-04|   １９４４年４月|
        |      1945|     １９４５年|
        |   1945-07|  １９４５年７月底|
        |   1945-08|   １９４５年８月|
        |1945-08-09| １９４５年８月９日|
        |1945-08-19|     ８月１９日|
        |   1945-11|  １９４５年１１月|
        |      1946|    １９４６年底|
        |   1946-05|   １９４６年５月|
    */
    val timex3featureDate = sqlContext.sql("select distinct value,name from timex3feature where type='DATE' order by value")
    timex3featureDate.show()
    timex3featureDate.repartition(1).write.mode(SaveMode.Overwrite).json(dataPath + "timex3featureDate")

    //2:DURATION
     /*
      +-------+------+
      |  value|  name|
      +-------+------+
      | P0.5CE|  半个世纪|
      | P0.5CE| 近半个世纪|
      |  P0.5D|    半日|
      |  P0.5D|    半天|
      |  P0.5M|    半月|
      |  P0.5M|   半个月|
      |  P0.5W|    半周|
      |  P0.5Y|    半年|
      |  P0.5Y|   近半年|
      |    P0D|    ０时|
      |    P0D|    零时|
      |    P0D|    ０日|
      |P10000D|    万日|
      |P10000D|   １万日|
      |P10000Y|    万年|
      |P10000Y|   一万年|
      |P10000Y|  近一万年|
      | P1000Y|    千年|
      |  P100D|    百日|
      |  P100D|    百天|
      |  P100Y|   近百年|
      |  P100Y|    百年|
      |  P100Y|   一百年|
      |   P10D|  明１０日|
      |   P10D|   前十天|
      |   P10D|  近１０日|
      |   P10D|   １０天|
      |   P10D| 此前１０日|
      |   P10D| 不到１０天|
      |   P10D|  前１０日|
      |   P10D| 未来１０日|
      |   P10D| 最后１０天|
      |   P10D|  上１０日|
      |   P10D|   １０日|
      |   P10D|  １０多天|
      |   P10M|   十月份|
      |   P10M|不过１０月份|
      |   P10M|  １０个月|
      |   P10M|   １０月|
      |   P10M|过去１０个月|
      |   P10M|  １０月份|
      |   P10M|    十月|
      |   P10Y|   十多年|
      |   P10Y|   十几年|
      |   P10Y|１０至１５年|
      |   P10Y|  近１０年|
      |   P10Y| 过去１０年|
      |   P10Y|   这十年|
      |   P10Y|  未来十年|
      |   P10Y|  这１０年|
      |   P10Y| 未来１０年|
      |   P10Y| 十到二十年|
      |   P10Y|１０到１５年|
      |   P10Y|    十年|
      |   P10Y|  过去十年|
      |   P10Y|  １０多年|
      |   P10Y| 今后１０年|
      |   P10Y|   近十年|
      |   P10Y| 不到１０年|
      |   P11D|   １１日|
      |   P11D| 直到１１日|
      |   P11M|  １１月份|
      |   P11M|大约十一个月|
      |   P11M|  １１个月|
      |   P11M| 前１１个月|
      |   P11M| 当年１１月|
      |   P11M|   １１月|
      |   P11Y|  上１１年|
      |   P11Y|差不多１１年|
      |   P11Y| 过去１１年|
      |   P12D|十二至十三日|
      |   P12D|   十二日|
      |   P12D|   １２天|
      |   P12D|   １２日|
      |   P12Y|  近１２年|
      |   P12Y|   十二年|
      |   P13D|   １３日|
      |   P13D|   １３天|
      |   P13D| 直到１３日|
      |   P13M|  １３个月|
      |   P13M|   十三月|
      |   P14D| 直到１４日|
      |   P14D|   １４日|
      |   P14D|   １４天|
      |   P14M|  １４月份|
      |   P14Y|   十四年|
      |   P15D|   １５日|
      |   P15D|   １５天|
      |   P15M| 近１５个月|
      |   P15Y|  近１５年|
      |   P15Y|不超过１５年|
      |   P15Y|   十五年|
      |   P15Y| 过去１５年|
      |   P15Y| 今后１５年|
      |   P16D|   十六日|
      |   P16D| 直到１６日|
      |   P16D|   １６日|
      |   P17D|   １７天|
      |   P17D|   １７日|
      |  P18CE|  １８世纪|
      |   P18D|   １８日|
      |   P18M|  １８个月|
      |   P18Y|   十八年|
      |  P19CE|  １９世纪|
      |   P19D|   １９日|
      |   P1CE|  一个世纪|
      |   P1CE| 近一个世纪|
      |   P1CE|   １世纪|
      |    P1D|   多一天|
      |    P1D|   前一天|
      |    P1D| 二十四小时|
      |    P1D|   第二天|
      |    P1D|   来一天|
      |    P1D|   当全天|
      |    P1D|   前一日|
      |    P1D|   当一天|
      |    P1D|    一天|
      |    P1D|    １天|
      |    P1D|  此前一天|
      |    P1D|  最后一天|
      |    P1D|   第三天|
      |    P1D|  ２４小时|
      |    P1D|   第四天|
      |    P1D|   只一天|
      |    P1D|    １日|
      |    P1D|   第六天|
      |    P1D|   新一天|
      |    P1D|    全天|
      |    P1D|   第五天|
      |    P1D|   这一天|
      |    P1D|   第一天|
      |    P1D|   第三日|
      |    P1D|   第十天|
      |    P1D|   ２４时|
      |    P1D|    全日|
      |    P1D|   第二日|
      |    P1D|   一个天|
      |    P1D|超过２４小时|
      |    P1D|    一日|
      |    P1D|  不到一天|
      |    P1D|  不过全天|
      |    P1D|  １至２天|
      |   P1DE|  这一时期|
      |   P1DE|  一个时期|
      |    P1M| 超过一个月|
      |    P1M|  前一个月|
      |    P1M|  上一个月|
      |    P1M|  近一个月|
      |    P1M|    １月|
      |    P1M|  这一个月|
      |    P1M|   １月份|
      |    P1M|   １个月|
      |    P1M|    一月|
      |    P1M|  后一个月|
      |    P1M| 不到一个月|
      |    P1M|  １月份多|
      |    P1M| 最后一个月|
      |    P1M|  最近１月|
      |    P1M|   一月份|
      |    P1M|  约一个月|
      |    P1M|   一个月|
      |    P1M| 不到１个月|
      |    P1M| 最近一个月|
      |    P1M| 过去一个月|
      |    P1Q|  前一季度|
      |    P1Q|   上一季|
      |    P1Q|   第二季|
      |    P1Q|   一季度|
      |    P1Q|  １个季度|
      |    P1Q|    一季|
      |    P1Q|   这一季|
      |    P1Q|  第二季度|
      |    P1Q|  第四季度|
      |    P1Q|  第一季度|
      |    P1Q|   第三季|
      |    P1Q|  上一季度|
      |    P1Q|   １季度|
      |    P1Q|  这一季度|
      |    P1Q|  第三季度|
      |    P1Q|   第一季|
      |    P1W|  不到一周|
      |    P1W|   第一周|
      |    P1W|  超过一周|
      |    P1W|  过去一周|
      |    P1W| 过去的一周|
      |    P1W|  １个星期|
      |    P1W|   前一周|
      |    P1W|   一周多|
      |    P1W|    １周|
      |    P1W|  一个星期|
      |    P1W|   近一周|
      |    P1W|   第二周|
      |    P1W|    全周|
      |    P1W|   一星期|
      |    P1W|不到一个星期|
      |    P1W|    一周|
      |    P1W|  此前一周|
      |    P1W|   这一周|
      |    P1W|  约一星期|
      |    P1W|  至少一周|
     */
    val timex3featureDuration = sqlContext.sql("select distinct value,name from timex3feature where type='DURATION' order by value")
    timex3featureDuration.show()
    timex3featureDuration.repartition(1).write.mode(SaveMode.Overwrite).json(dataPath + "timex3featureDuration")
    //3:TIME
    /*
          +----------------+-------+
         |           value|   name|
         +----------------+-------+
         |   1944-02-14TEV|   当天晚上|
         |   1976-05-16TEV|   当日晚上|
         |   1981-06-30TEV|     昨晚|
         |   1988-06-15TAF|   当天下午|
         |   1999-09-19TMO|   昨天上午|
         |   2001-06-30TMO|   明天凌晨|
         |   2002-05-29TAF|   昨天下午|
         |   2002-05-30TEV|   前天晚上|
         |   2002-05-30TEV|   当天晚上|
         |   2002-06-01TEV|     当晚|
         |   2002-06-07T24:30|晚１２时３０分|
         |   2003-05-12TEV|     当晚|
         |   2004-04-22TEV|     昨晚|
         |   2004-04-23TEV|     昨晚|
         |   2004-04-24TEV|     昨晚|
         |   2004-04-25TEV|     昨晚|
         |   2004-10-13TMO|   昨日上午|
         |   2006-05-14TAF|   当天下午|
         |   2006-05-19TAF|   当天下午|
         |   2006-05-27TMO|   昨日上午|
     */
    val timex3featureTime = sqlContext.sql("select distinct value,name from timex3feature where type='TIME' order by value")
    timex3featureTime.show()
    timex3featureTime.repartition(1).write.mode(SaveMode.Overwrite).json(dataPath + "timex3featureTime")


    //SET
    /*
        +----------------+-----+
        |           value| name|
        +----------------+-----+
        |             P1D|   每日|
        |             P1D|  每一天|
        |             P1D|   每天|
        |            P1DE| 每个时期|
        |             P1M|   每月|
        |             P1M|  每个月|
        |             P1Q|   每季|
        |             P1W|  每星期|
        |             P1W|   每周|
        |            P1WE| 每个周末|
        |             P1Y|  每一年|
        |             P1Y|   每年|
        |            PT1H|  每小时|
        |            PT1M|  每分钟|
        |            PT1S|   每秒|
        |          XXXX-1|  每周一|
        |          XXXX-1|每个星期一|
        |          XXXX-2|  每周二|
        |          XXXX-5| 每星期五|
        |   XXXX-WXX-1TEV|  周一晚|
        |   XXXX-WXX-2TEV| 周二傍晚|
        |   XXXX-WXX-2TEV|  周二晚|
        |   XXXX-WXX-2TEV| 周二晚上|
        |   XXXX-WXX-4TAF| 周四下午|
        |   XXXX-WXX-4TEV|  周四晚|
        |   XXXX-WXX-4TMO| 周四凌晨|
        |   XXXX-WXX-4TMO| 周四早上|
        |   XXXX-WXX-5TAF|星期五下午|
        |   XXXX-WXX-5TEV|  周五晚|
        |   XXXX-WXX-5TEV|星期五晚上|
        |   XXXX-WXX-6TAF| 周六下午|
        |   XXXX-WXX-6TEV| 周六傍晚|
        |   XXXX-WXX-6TEV|  周六晚|
        |   XXXX-WXX-6TMO| 周六上午|
        |XXXX-WXX-7T24:00| 周日午夜|
        |   XXXX-WXX-7TEV|  周日晚|
     */
    val timex3featureSET = sqlContext.sql("select  distinct value,name from timex3feature where type='SET' order by value")
    timex3featureSET.show()
    timex3featureSET.repartition(1).write.mode(SaveMode.Overwrite).json(dataPath + "timex3featureSET")
    sc.stop()
  }
}
